In [1]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [2]:
for schools in high_schools:
    print(schools)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [3]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [4]:
for highschool in high_school_types:
    print(highschool)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [5]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [6]:
# Add the Pandas dependency.
import pandas as pd

In [8]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [9]:
for skuul in school_series:
    print(skuul)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [10]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [11]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [12]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [13]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [14]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Print the DataFrame.
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [16]:
schools_df["school_name"] = school_name

schools_df

   School ID            school_name            type
0          0      Huang High School  <class 'type'>
1          1   Figueroa High School  <class 'type'>
2          2    Shelton High School  <class 'type'>
3          3  Hernandez High School  <class 'type'>
4          4    Griffin High School  <class 'type'>

In [22]:
schools_df[ "type"]= type
schools_df

   School ID            school_name            type
0          0      Huang High School  <class 'type'>
1          1   Figueroa High School  <class 'type'>
2          2    Shelton High School  <class 'type'>
3          3  Hernandez High School  <class 'type'>
4          4    Griffin High School  <class 'type'>

In [23]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [24]:

# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [25]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Print the DataFrame.
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [31]:
schools_df["school_name"] = school_name
schools_df["type"] = type
schools_df

,School ID,Huang High School,Figueroa High School,Shelton High School,Hernandez High School,Griffin High School,school_name,type
0,0,Huang High School,Figueroa High School,Shelton High School,Hernandez High School,Griffin High School,Huang High School,<class 'type'>
1,1,Huang High School,Figueroa High School,Shelton High School,Hernandez High School,Griffin High School,Figueroa High School,<class 'type'>
2,2,Huang High School,Figueroa High School,Shelton High School,Hernandez High School,Griffin High School,Shelton High School,<class 'type'>
3,3,Huang High School,Figueroa High School,Shelton High School,Hernandez High School,Griffin High School,Hernandez High School,<class 'type'>
4,4,Huang High School,Figueroa High School,Shelton High School,Hernandez High School,Griffin High School,Griffin High School,<class 'type'>

In [32]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [34]:
schooldict_df = pd.DataFrame()

In [36]:
schooldict_df["high_schools_dict"] = high_schools_dict

In [37]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [38]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [39]:
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)